'''
Представлен список чисел. Определить элементы списка, не имеющие повторений.
Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести
в порядке их следования в исходном списке. Для выполнения задания обязательно
использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
'''

initial_list = [1,2,4,2,1,5,8,0,9,5,32,43,9,6,2,1,4,7,9,0,9,9,9]
result = [8,32,43,6,7]
def unique_numbers(list):
    result_list = [number for number in list if list.count(number) == 1]
    return result_list
print(unique_numbers(initial_list))