'''
Представлен список чисел. Необходимо вывести элементы исходного списка,
значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
'''

initial_list = [1,3,5,46346,685,213,22,3,1,]
result_list = [number for counter, number
               in enumerate(initial_list)
               if (counter and number > initial_list[counter - 1]) == True]
print(result_list)