'''
Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
Требуется определить номер дня, на который общий результат спортсмена составить не менее b
километров. Программа должна принимать значения параметров a и b и выводить одно натуральное
число — номер дня.
'''

print('Введите длину пробежки в певый день в км')
initial_length = float(input())
print('Введите целевую длину пробежки в км')
goal_length = float(input())
counter = 0
while goal_length > initial_length:
    initial_length = initial_length * 1.1
    counter = counter + 1
print(f'Спортсмен достигнет цели через {counter + 1} дней')